apple-open-source/macos/IOUSBMassStorageClass/UMCLogger/UMCLogger.cpp
			}
			break;
			
			case kLUNConfigurationCompleteCode:
			{
				printf ( "[%p] MaxLUN = %u\n", ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kNewCommandWhileTerminatingCode:
			{
				printf ( "[%p] Task = %p received while terminating!!!\n", ( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kIOUMCStorageCharacDictFoundCode:
			{
				printf ( "[%p] This device has a USB Characteristics Dictionary\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kNoProtocolForDeviceCode:
			{
				printf ( "[%p] !!! NO USB TRANSPORT PROTOCOL FOR THIS DEVICE !!!\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kIOUSBMassStorageClassStartCode:
			{
				printf ( "[%p] Starting up!\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kIOUSBMassStorageClassStopCode:
			{
				printf ( "[%p] Stopping!\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kAtUSBAddressCode:
			{
				printf ( "[%p] @ USB Address: %u\n", ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kMessagedCalledCode:
			{
				printf ( "[%p] Message : %x received\n", ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kWillTerminateCalledCode:
			{
				printf ( "[%p] willTerminate called, CurrentInterface=%p, isInactive=%u\n", 
					( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3 );
			}
			break;
			
			case kDidTerminateCalledCode:
			{
				printf ( "[%p] didTerminate called, fTerminationDeferred=%u\n", 
						( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kCDBLog1Code:
			{

				UInt8 *			cdbData;
				unsigned int	i;
				
				printf ( "[%p] Request %p\n", ( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
				printf ( "[%p] ", ( void * ) gTraceBuffer[index].arg1 );
				
				cdbData = ( UInt8 * ) &gTraceBuffer[index].arg3;
				
				for ( i = 0; i < 4; i++ )
					printf ( "%x : ", cdbData[i] );
				
				cdbData = ( UInt8 * ) &gTraceBuffer[index].arg4;
				
				for ( i = 0; i < 4; i++ )
					printf ( "%x : ", cdbData[i] );

			}
			break;		
			
			case kCDBLog2Code:
			{

				UInt8 *			cdbData;
				unsigned int 	i;
				
				cdbData = ( UInt8 * ) &gTraceBuffer[index].arg3;
				
				for ( i = 0; i < 4; i++ )
					printf ( "%x : ", cdbData[i] );
				
				cdbData = ( UInt8 * ) &gTraceBuffer[index].arg4;
				
				for ( i = 0; i < 3; i++ )
					printf ( "%x : ", cdbData[i] );
				
				printf ( "%x\n", cdbData[i] );
				
			}
			break;	
			
			case kClearEndPointStallCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
				printf ( "[%p] ClearFeatureEndpointStall status=%s (0x%x), endpoint=%u\n", 
						( void * ) gTraceBuffer[index].arg1, errorString, ( unsigned int ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3 );
				
			}
			break;
			
			case kGetEndPointStatusCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
				printf ( "[%p] GetEndpointStatus status=%s (0x%x), endpoint=%u\n", 
						( void * ) gTraceBuffer[index].arg1, errorString, ( unsigned int ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3 );		
				
			}
			break;
			
			case kHandlePowerOnUSBResetCode:
			{
				
				printf ( "[%p] USB Device Reset on WAKE from SLEEP\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kUSBDeviceResetWhileTerminatingCode:
			{
				
				printf ( "%p Termination started before device reset could be initiated! fTerminating=%u, isInactive=%u\n", 
                            ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3 );
				
			}
			break;
			
			case kUSBDeviceResetAfterDisconnectCode:
			{
				
				printf ( "[%p] Device reset was attempted after the device had been disconnected\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kUSBDeviceResetReturnedCode:
			{
				
				printf ( "[%p] DeviceReset returned: 0x%08x\n", ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
				
			}
			break;
			
#pragma mark -
#pragma mark *** Control Bulk Interrupt ( CBI ) Codess ***
#pragma mark -
			
			case kCBIProtocolDeviceDetectedCode:
			{
				
				printf ( "[%p] CBI transport protocol device\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kCBICommandAlreadyInProgressCode:
			{
			
				if ( gHideBusyRejectedCommands == FALSE )
				{
					
					printf ( "[%p] CBI - Unable to accept task %p, still working on previous command\n", 
								( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
					
				}
				
			}
			break;
			
			case kCBISendSCSICommandReturnedCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg3 );
				printf ( "[%p] CBI - SCSI Task %p was sent with status %s (0x%x)\n", 
							( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2, errorString, ( unsigned int ) gTraceBuffer[index].arg3 );
				
			}
			break;
			
#pragma mark -
#pragma mark *** Bulk-Only Protocol Codes ***
#pragma mark -
			
			case kBODeviceDetectedCode:
			{
				
				printf ( "[%p] BULK-ONLY transport protocol device\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kBOCommandAlreadyInProgressCode:
			{
				
				if ( gHideBusyRejectedCommands == FALSE )
				{
					
					printf ( "[%p] B0 Unable to accept task %p, still working on previous request\n", 
								( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
					
				}
				
			}
			break;
			
			case kBOSendSCSICommandReturnedCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg3 );
				printf ( "[%p] BO - SCSI Task %p was sent with status %s (0x%x)\n", 
								( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2, errorString, ( unsigned int ) gTraceBuffer[index].arg3 );				
				
